IMU_RESOURCES/instruction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-08 Mon 15:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2b2da55">1. Synopsis</a>
<ul>
<li><a href="#org317796c">1.1. IMU Project File Description</a>
<ul>
<li><a href="#orgbb6bf51">1.1.1. "IMU<sub>Unity</sub><sub>Server</sub>" Project</a></li>
<li><a href="#orge90de87">1.1.2. "IMUJY901<sub>python</sub><sub>client</sub>" Project</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaafc485">2. IMU Related</a>
<ul>
<li><a href="#org1d39cb6">2.1. Gyo Calibration</a>
<ul>
<li><a href="#org46b3158">2.1.1. Bias Error</a></li>
<li><a href="#org548c0a4">2.1.2. Calculate the Bias Offset</a></li>
<li><a href="#orge7b4219">2.1.3. Results</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2b2da55" class="outline-2">
<h2 id="org2b2da55"><span class="section-number-2">1</span> Synopsis</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org317796c" class="outline-3">
<h3 id="org317796c"><span class="section-number-3">1.1</span> IMU Project File Description</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgbb6bf51" class="outline-4">
<h4 id="orgbb6bf51"><span class="section-number-4">1.1.1</span> "IMU<sub>Unity</sub><sub>Server</sub>" Project</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>IMU<sub>DUO3D.cs</sub>
DUO3D IMU Unity server script, used to receive the orientation data from DUO3D client</li>
<li>IMU<sub>JY901BT.cs</sub>
JY901BT IMU Unity server script, used to receive the orientation data from JY901BT client</li>
</ul>
</div>
</div>
<div id="outline-container-orge90de87" class="outline-4">
<h4 id="orge90de87"><span class="section-number-4">1.1.2</span> "IMUJY901<sub>python</sub><sub>client</sub>" Project</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
It's the JY901BT IMU client, used to send Gyo data to IMU Unity server
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaafc485" class="outline-2">
<h2 id="orgaafc485"><span class="section-number-2">2</span> IMU Related</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org1d39cb6" class="outline-3">
<h3 id="org1d39cb6"><span class="section-number-3">2.1</span> Gyo Calibration</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-org46b3158" class="outline-4">
<h4 id="org46b3158"><span class="section-number-4">2.1.1</span> Bias Error</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Bias error is nonzero output signal which appears in the sensor output when input is zero. The bias offset causes the sensor output to offset from the true data by a constant value. This error is not dependent on external forces applied to the sensor. Bias error can be divided into three categories, including a static part (or bias offset), a random part (or drift), and a temperature dependent part. The static bias and temperature bias can be compensated in the calibration process. Static bias can be measured by averaging the sensor output for a zero input signal. To compensate for this bias, it should be subtracted from the output data. The drift bias has a random nature and cannot be fixed in the calibration process. It should be treated as a stochastic error. 
</p>
</div>
</div>

<div id="outline-container-org548c0a4" class="outline-4">
<h4 id="org548c0a4"><span class="section-number-4">2.1.2</span> Calculate the Bias Offset</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Keep the DUO3D IMU in static stastus, and then track the Gyo data output to calculate the bias error.
</p>
<ul class="org-ul">
<li>pictures: ./pictures/GyoRawData.jpg</li>
<li>data: ./data/originalIMU.txt</li>
<li>Matlab scripts</li>
</ul>

<div class="org-src-container">
<pre class="src src-matlab">%The IMU data 
originalFp=fopen('originalIMU.txt');
%[Gyo,count]=fscanf(fd,'Gyro: %f , %f , %f')
Gyo=fscanf(originalFp,'%f,%f,%f',[3 Inf]);
Gyo=Gyo';
fclose(originalFp);

%plot
plot(Gyo)
%xlable('No. of samples'),ylable('Output')
title('Original Gyo data')
%axis([0,3000,-10,10]);
</pre>
</div>

<p>
Avarage Value:
[ -1.7996    1.6850    0.1413]
</p>

<p>
This is the bias error of Gyroscope and this value need to be subtracted.
</p>
</div>
</div>
<div id="outline-container-orge7b4219" class="outline-4">
<h4 id="orge7b4219"><span class="section-number-4">2.1.3</span> Results</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<a href="./img/Gyo_ori_kalman_bias_compare.jpg ">./img/Gyo_ori_kalman_bias_compare.jpg </a></p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-05-08 Mon 15:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
